import React from 'react';

const ProjectInitiative = () => (
  <div className="row">
    <div className="col-1"/>
    <div className="intro-text col-7">
      <p>我为什么会做这个项目，有以下几点原因。</p>

      <p>第一点，我认为优秀的开发者不仅能写好代码，还要有产品头脑，具备产品设计方面的知识。能做出一个有用，易用，给用户带来价值的产品。
        并且熟悉产品的生命周期，对一个产品能从设计，开发，测试到上线都有所掌握。这个网站就是基于这个想法，结合我个人自学技术的经历所产生的。</p>

      <p>万事开头难，在我开始自学编程和开发时，不知道从什么技术开始学起，我身边的同学朋友也没有做技术的，没有人可以去问，所以就想到让市场来决定，
        市场中最需要哪些技术，我就学哪些。我是金融专业的，做技术去金融科技行业应该成功率是最高的，所以我就浏览了大量金融科技行业招聘的工作描述，
        从中寻找和总结哪些编程语言，框架、库和技术栈出现的频率最高，然后专心学习这些技术。实践证明这个方法是很有效的，所以当我想做出一个产品时，
        我回想起当时从海量招聘信息里寻找的费时费力，就想到用技术把这个过程自动化，做出一个高效、易用的产品。
      </p>

      <p>第二点，我相信产品驱动技术，这点不仅在工作中适用，在提升个人技术水平的过程中也是适用的。有了这个项目，每想实现一个新功能，都会驱动我去学习新的技术，
        相比纯粹的技术学习，这种学习方式是更加高效的。即使在纯技术学习的过程中，当了解到了一些更好的设计模式、算法时，在工作中往往由于各种限制不能立刻用到代码里，
        但是可以立刻用到这个项目上，大大提高了学习的效率。
      </p>

      <p>第三点，有了个人网站，可以帮助猎头和面试官们更好的了解我。企业招聘中都想找到合适的人才，但是仅从一纸简历上并不能完全了解一个人，简历的同质化也比较严重。
        企业招聘不是一件简单的事情，即使有着科学、严格的面试流程，也不一定100%保证达到预期的效果。并且比起错误的否定一个候选人，更严重的问题的是错误肯定：有些候选人
        可能在面试中表现的很好，实际工作中不一定做的好。这是因为在面试中，有些问题中有些是可以快速习得的，而优秀的品质则需要长期的的坚持与磨练，在短时间的面试中很难评估出来。
      </p>

      <p>接下来的页面就是我个人生活，学习和工作习惯的展示，希望可以帮助到你们更全面的了解我。</p>
    </div>
    <div className="col-1"/>
  </div>
);

export default ProjectInitiative;